package com.example.fontchanger.fonts

object Style5_Runes {
    val map: Map<Char, Char> = mapOf(
        'а' to 'ᚤ', 'б' to 'Ꮆ', 'в' to 'ᛒ', 'г' to 'ᛚ', 'д' to 'ᚦ',
        'е' to 'ᛊ', 'ё' to 'ᛊ', 'ж' to 'ᛯ', 'з' to '℥', 'и' to 'ᛋ',
        'й' to 'ᛋ', 'к' to 'ᛕ', 'л' to 'ᚳ', 'м' to 'ᛖ', 'н' to 'ᚺ',
        'о' to 'ᛜ', 'п' to 'ᚢ', 'р' to 'ᚹ', 'с' to 'ᛈ', 'т' to 'ᛠ',
        'у' to 'ᚴ', 'ф' to 'ᛄ', 'х' to 'ᚷ', 'ц' to 'ᛪ', 'ч' to 'ᛋ',
        'ш' to 'Ⱎ', 'щ' to 'Ⱎ', 'ъ' to 'ᛧ', 'ы' to 'Ⱃ', 'ь' to 'Ⱃ',
        'э' to 'ᛁ', 'ю' to 'Ⱃ', 'я' to 'Ⰵ',
        'А' to 'ᚤ', 'Б' to 'Ꮆ', 'В' to 'ᛒ', 'Г' to 'ᛚ', 'Д' to 'ᚦ',
        'Е' to 'ᛊ', 'Ё' to 'ᛊ', 'Ж' to 'ᛯ', 'З' to '℥', 'И' to 'ᛋ',
        'Й' to 'ᛋ', 'К' to 'ᛕ', 'Л' to 'ᚳ', 'М' to 'ᛖ', 'Н' to 'ᚺ',
        'О' to 'ᛜ', 'П' to 'ᚢ', 'Р' to 'ᚹ', 'С' to 'ᛈ', 'Т' to 'ᛠ',
        'У' to 'ᚴ', 'Ф' to 'ᛄ', 'Х' to 'ᚷ', 'Ц' to 'ᛪ', 'Ч' to 'ᛋ',
        'Ш' to 'Ⱎ', 'Щ' to 'Ⱎ', 'Ъ' to 'ᛧ', 'Ы' to 'Ⱃ', 'Ь' to 'Ⱃ',
        'Э' to 'ᛁ', 'Ю' to 'Ⱃ', 'Я' to 'Ⰵ'
    )
}
