package com.example.fontchanger.fonts

object Style2_Glyphs {
    val map: Map<Char, Char> = mapOf(
        'а' to 'ꁲ', 'б' to 'ꃥ', 'в' to 'ꃃ', 'г' to '꒕', 'д' to 'ꅓ',
        'е' to 'ꂅ', 'ё' to 'ꂅ', 'ж' to 'ꏁ', 'з' to 'ꁘ', 'и' to '꒱',
        'й' to '꒱', 'к' to 'ꈤ', 'л' to 'ꂪ', 'м' to 'ꀊ', 'н' to 'ꂵ',
        'о' to 'ꍬ', 'п' to 'ꏿ', 'р' to 'ꊮ', 'с' to 'ꉣ', 'т' to 'ꊐ',
        'у' to 'ꉢ', 'ф' to 'ꌦ', 'х' to 'ꂈ', 'ц' to 'ꉧ', 'ч' to 'ꈥ',
        'ш' to 'ꃏ', 'щ' to 'ꅐ', 'ъ' to 'ꁁ', 'ы' to 'ꀲ', 'ь' to 'ꎪ',
        'э' to 'ꎆ', 'ю' to 'ꂼ', 'я' to 'ꋪ',
        'А' to 'ꁲ', 'Б' to 'ꃥ', 'В' to 'ꃃ', 'Г' to '꒕', 'Д' to 'ꅓ',
        'Е' to 'ꂅ', 'Ё' to 'ꂅ', 'Ж' to 'ꏁ', 'З' to 'ꁘ', 'И' to '꒱',
        'Й' to '꒱', 'К' to 'ꈤ', 'Л' to 'ꂪ', 'М' to 'ꀊ', 'Н' to 'ꂵ',
        'О' to 'ꍬ', 'П' to 'ꏿ', 'Р' to 'ꊮ', 'С' to 'ꉣ', 'Т' to 'ꊐ',
        'У' to 'ꉢ', 'Ф' to 'ꌦ', 'Х' to 'ꂈ', 'Ц' to 'ꉧ', 'Ч' to 'ꈥ',
        'Ш' to 'ꃏ', 'Щ' to 'ꅐ', 'Ъ' to 'ꁁ', 'Ы' to 'ꀲ', 'Ь' to 'ꎪ',
        'Э' to 'ꎆ', 'Ю' to 'ꂼ', 'Я' to 'ꋪ'
    )
}
