package com.example.fontchanger.fonts

object Style7_Greek {
    val map: Map<Char, Char> = mapOf(
        'а' to 'α', 'б' to 'β', 'в' to 'ν', 'г' to 'γ', 'д' to 'δ',
        'е' to 'ε', 'ё' to 'ε', 'ж' to 'ζ', 'з' to 'η', 'и' to 'ι',
        'й' to 'ϊ', 'к' to 'κ', 'л' to 'λ', 'м' to 'μ', 'н' to 'η',
        'о' to 'ο', 'п' to 'π', 'р' to 'ρ', 'с' to 'ς', 'т' to 'τ',
        'у' to 'υ', 'ф' to 'φ', 'х' to 'χ', 'ц' to 'ψ', 'ч' to 'ϲ',
        'ш' to 'ω', 'щ' to 'ϣ', 'ъ' to 'ϋ', 'ы' to 'ϋ', 'ь' to 'ϐ',
        'э' to 'ε', 'ю' to 'ϋ', 'я' to 'λ',
        'А' to 'Α', 'Б' to 'Β', 'В' to 'Ν', 'Г' to 'Γ', 'Д' to 'Δ',
        'Е' to 'Ε', 'Ё' to 'Ε', 'Ж' to 'Ζ', 'З' to 'Η', 'И' to 'Ι',
        'Й' to 'Ϊ', 'К' to 'Κ', 'Л' to 'Λ', 'М' to 'Μ', 'Н' to 'Η',
        'О' to 'Ο', 'П' to 'Π', 'Р' to 'Ρ', 'С' to 'Σ', 'Т' to 'Τ',
        'У' to 'Υ', 'Ф' to 'Φ', 'Х' to 'Χ', 'Ц' to 'Ψ', 'Ч' to 'Ϲ',
        'Ш' to 'Ω', 'Щ' to 'Ϣ', 'Ъ' to 'Ϋ', 'Ы' to 'Ϋ', 'Ь' to 'Β',
        'Э' to 'Ε', 'Ю' to 'Ϋ', 'Я' to 'Λ'
    )
}
