package com.example.fontchanger.fonts

object Style3_Coptic {
    val map: Map<Char, Char> = mapOf(
        'а' to 'ⲁ', 'б' to 'ⳝ', 'в' to 'ⲃ', 'г' to 'ⲅ', 'д' to 'ⲇ',
        'е' to 'ⲉ', 'ё' to 'ⲉ', 'ж' to 'ⲿ', 'з' to 'ⳅ', 'и' to 'υ',
        'й' to 'υ', 'к' to 'ⲕ', 'л' to 'ⲗ', 'м' to 'ⲙ', 'н' to 'ⲏ',
        'о' to 'ⲟ', 'п' to 'ⲡ', 'р' to 'ⲣ', 'с' to 'ⲥ', 'т' to 'ⲧ',
        'у' to 'ⲩ', 'ф' to 'φ', 'х' to 'ⲭ', 'ц' to 'ⳡ', 'ч' to 'ɥ',
        'ш' to 'ɯ', 'щ' to 'պ', 'ъ' to 'ъ', 'ы' to 'ы', 'ь' to 'ь',
        'э' to 'ⲉ', 'ю' to 'ю', 'я' to 'я',
        'А' to 'Ⲁ', 'Б' to 'ⳝ', 'В' to 'Ⲃ', 'Г' to 'Ⲅ', 'Д' to 'Ⲇ',
        'Е' to 'Ⲉ', 'Ё' to 'Ⲉ', 'Ж' to 'Ⲿ', 'З' to 'Ⳅ', 'И' to 'Ⲩ',
        'Й' to 'Ⲩ', 'К' to 'Ⲕ', 'Л' to 'Ⲗ', 'М' to 'Ⲙ', 'Н' to 'Ⲏ',
        'О' to 'Ⲟ', 'П' to 'Ⲡ', 'Р' to 'Ⲣ', 'С' to 'Ⲥ', 'Т' to 'Ⲧ',
        'У' to 'Ⲩ', 'Ф' to 'Ⲫ', 'Х' to 'Ⲭ', 'Ц' to 'Ⳡ', 'Ч' to 'ɥ',
        'Ш' to 'ɯ', 'Щ' to 'պ', 'Ъ' to 'ъ', 'Ы' to 'ы', 'Ь' to 'ь',
        'Э' to 'Ⲉ', 'Ю' to 'ю', 'Я' to 'я'
    )
}
