package com.example.fontchanger.fonts

object Style1_Flowing {
    val map: Map<Char, Char> = mapOf(
        'а' to 'ᥲ', 'б' to 'ⳝ', 'в' to 'ⲃ', 'г' to '𐔏', 'д' to 'ⲇ',
        'е' to 'ᥱ', 'ё' to 'ᥱ', 'ж' to 'ⲿ', 'з' to 'ⳅ', 'и' to 'υ',
        'й' to 'υ', 'к' to 'ⲕ', 'л' to '᥈', 'м' to 'ⲙ', 'н' to 'ⲏ',
        'о' to '𐔖', 'п' to 'ᥒ', 'р' to 'ρ', 'с' to 'ᥴ', 'т' to 'ⲧ',
        'у' to '𐔤', 'ф' to 'ⲫ', 'х' to 'ⲭ', 'ц' to 'ц', 'ч' to 'ɥ',
        'ш' to 'ɯ', 'щ' to 'պ', 'ъ' to '𐔊', 'ы' to 'ы', 'ь' to 'ь',
        'э' to 'ⲉ', 'ю' to 'ю', 'я' to 'я',
        // Заглавные — те же символы (у этих блоков нет регистра)
        'А' to 'ᥲ', 'Б' to 'ⳝ', 'В' to 'ⲃ', 'Г' to '𐔏', 'Д' to 'ⲇ',
        'Е' to 'ᥱ', 'Ё' to 'ᥱ', 'Ж' to 'ⲿ', 'З' to 'ⳅ', 'И' to 'υ',
        'Й' to 'υ', 'К' to 'ⲕ', 'Л' to '᥈', 'М' to 'ⲙ', 'Н' to 'ⲏ',
        'О' to '𐔖', 'П' to 'ᥒ', 'Р' to 'ρ', 'С' to 'ᥴ', 'Т' to 'ⲧ',
        'У' to '𐔤', 'Ф' to 'ⲫ', 'Х' to 'ⲭ', 'Ц' to 'ц', 'Ч' to 'ɥ',
        'Ш' to 'ɯ', 'Щ' to 'պ', 'Ъ' to '𐔊', 'Ы' to 'ы', 'Ь' to 'ь',
        'Э' to 'ⲉ', 'Ю' to 'ю', 'Я' to 'я'
    )
}
